# Initial State: { "Input symbol": ("Next state", "Output symbol") }
transition_table_eh = {

    ##  Consonant & Vowel
    "s0": {  
        "k": ("s_cv0", ""), # क,ख
        "g": ("s_cv1", ""), # ग,घ
        "c": ("s_cv2", ""), # च
        "C": ("s_cv3", ""), # छ
        "j": ("s_cv4", ""), # ज,झ
        "T": ("s_cv5", ""), # ट,ठ
        "D": ("s_cv6", ""), # ड,ढ
        "N": ("s_cv7", ""), # ण
        "t": ("s_cv8", ""), # त,थ
        "d": ("s_cv9", ""), # द,ध
        "n": ("s_cv10", ""), # न
        "p": ("s_cv11", ""), # प,फ
        "b": ("s_cv12", ""), # ब,भ
        "m": ("s_cv13", ""), # म
        "y": ("s_cv14", ""), # य
        "r": ("s_cv15", ""), # र
        "l": ("s_cv16", ""), # ल
        "v": ("s_cv17", ""), # व
        "s": ("s_cv18", ""), # श,स
        "S": ("s_cv19", ""), # ष
        "h": ("s_cv20", ""), # ह
        "L": ("s_cv21", ""), # ळ ( ऌ,ॡ #independent vowels)
        "~": ("s_cv22", ""), # ङ,ञ
        ".": ("s_cv31", ""), # । ,ऽ
        " ": ("s0", " "), # Space
        "*": ("s_cVowel",""),
        
        

        # Consonants with Nuqta
        "q": ("s_cv32", ""), # क़
        "K": ("s_cv33", ""), # ख़
        "G": ("s_cv34", ""), # ग़
        "z": ("s_cv35", ""), # ज़
        "f": ("s_cv36", ""), # फ़
        "w": ("s_cv37", ""), # व़
        

        # Irregular Consonants Cluster (some are in s_cv0,cv8,cv35,cv4,c    v18)
        "x": ("s_cv38", ""), # क्ष
    
    },
    # they can be independent (VOWELS) (some in cv21)
    "s_cVowel" :{
        "a": ("s_cv23", ""), # अ,आ,ऍ,ऐ,औ,ॲ
        "A": ("s_cv24", ""), # आ,ऑ
        "i": ("s_cv25", ""), # इ,ई
        "I": ("s0", "ई"),    # ई
        "e": ("s_cv26", ""), # ई ,ए
        "E": ("s0", "ए"),    # ए
        "u": ("s_cv27", ""), # उ,ऊ
        "m": ("s0","ं"), # ं
        "o": ("s0", "ओ"), # ओ
        "O": ("s_cv30", ""), # ओ
        
        "L": ("s_cv21", ""), #ऌ,ॡ
    },
    "s_cv0": { 
        "a": ("s_v", "क"),
        "h": ("s_v", "ख"),
        "others": ("s_v", "क"),
        "S": ("s_cv0_0", ""), #irregular consonants cluster
    },
    "s_cv0_0": { 
        "a": ("s_v", "क्ष"),
        "h": ("s_cv0_1", ""),
        "others": ("s_v", "क्ष"),
    },
    "s_cv0_1": {
        "a": ("s_v", "क्ष"),
        "others": ("s_v", "क्ष"),
    },

    "s_cv1": { 
        "a": ("s_v", "ग"),
        "h": ("s_cv1_0", ""),
        "others": ("s_v", "ग"),
    },
    "s_cv1_0": { 
        "a": ("s_v", "घ"),
        "others": ("s_v", "घ"),        
    },
    "s_cv2": { 
        "h": ("s_cv2_0", ""),    
    },
    "s_cv2_0": { 
        "a": ("s_v", "च"),
        "others": ("s_v", "च"),
    },
    "s_cv3": { 
        "h": ("s_cv3_0", ""),    
    },
    "s_cv3_0": { 
        "a": ("s_v", "छ"),
        "others": ("s_v", "छ"),
    },
    "s_cv4": { 
        "h": ("s_cv4_0", ""),
        "a": ("s_v", "ज"),
        "others": ("s_v", "ज"),
    },
    "s_cv4_0": {
        "a": ("s_v", "झ"),
        "~": ("s_cv4_1", ""),
        "others": ("s_v", "झ"),
    },
    "s_cv4_1": {
        "n": ("s_cv4_2", ""),
    },
    "s_cv4_2": {
        "a": ("s_v", "ज्ञ"),
        "others": ("s_v", "ज्ञ"),
    },
    "s_cv5": { 
        "a": ("s_v", "ट"),
        "h": ("s_cv5_0", ""),        
        "m": ("s0","ं"), # ं
        "M": ("s0","ं"), # ं
        "others": ("s_v", "ट"),
    },
    "s_cv5_0": {
        "a": ("s_v", "ठ"),
        "others": ("s_v", "ठ"),
    },
    "s_cv6": { 
        "a": ("s_v", "ड"),
        "h": ("s_cv6_0", ""),
        "others": ("s_v", "ड"),
    },
    "s_cv6_0": { 
        "a": ("s_v", "ढ"),
        "others": ("s_v", "ढ"),
    },        "m": ("s0","ं"), # ं
    "s_cv7": {
        "a": ("s_v", "ण"),
        "others": ("s_v", "ण"),
    },
    "s_cv8": { 
        "a": ("s_v", "त"),
        "h": ("s_cv8_0", ""),
        "r": ("s_cv8_1", ""),
        "others": ("s_v", "त"),
        
    },
    "s_cv8_0": { 
        "a": ("s_v", "थ"),
        "others": ("s_v", "थ"),
    },
    "s_cv8_1": { 
        "a": ("s_v", "त्र"),
        "others": ("s_v", "त्र"),
    }, 
    "s_cv9": { 
        "a": ("s_v", "द"),
        "h": ("s_cv9_0", ""),
        "others": ("s_v", "द"),
    },
    "s_cv9_0": { 
        "a": ("s_v", "ध"),
        "others": ("s_v", "ध"),
    },
    "s_cv10": { 
        "a": ("s_v", "न"),
        "others": ("s_v", "न"),
    },
    "s_cv11": { 
        "a": ("s_v", "प"),
        "h": ("s_cv11_0", ""),
        "others": ("s_v", "प"),
    },
    "s_cv11_0": { 
        "a": ("s_v", "फ"),
        "others": ("s_v", "फ"),
    },
    "s_cv12": { 
        "a": ("s_v", "ब"),
        "h": ("s_cv12_0", ""),
        "others": ("s_v", "ब"),
    },
    "s_cv12_0": { 
        "a": ("s_v", "भ"),
        "others": ("s_v", "भ"),
    },
    "s_cv13": { 
        "a": ("s_v", "म"),
        "others": ("s_v", "म"),
    },
    "s_cv14": { 
        "a": ("s_v", "य"),
        "others": ("s_v", "य"),
    },
    "s_cv15": { 
        "a": ("s_v", "र"),
        "others": ("s_v", "र"),
    },
    "s_cv16": { 
        "a": ("s_v", "ल"),
        "others": ("s_v", "ल"),
    },
    "s_cv17": { 
        "a": ("s_v", "व"),
        "others": ("s_v", "व"),
    },
    "s_cv18": { 
        "a": ("s_v", "स"),
        "h": ("s_cv18_0", ""),
        "others": ("s_v", "स"),
    },
    "s_cv18_0": { 
        "a": ("s_v", "श"),
        "r": ("s_cv18_1", ""),
        "others": ("s_v", "श"),
    },
    "s_cv18_1": { 
        "a": ("s_v", "श्र"),
        "others": ("s_v", "श्र"),
    },
    "s_cv19": { 
        "h": ("s_cv19_0", ""),
        "others": ("s_v", "ष"),
    },
    "s_cv19_0": { 
        "a": ("s_v", "ष"),
        "others": ("s_v", "ष"),
    },
    "s_cv20": { 
        "a": ("s_v", "ह"),
        "others": ("s_v", "ह"),
    },
    "s_cv21": { 
        "a": ("s_v", "ळ"),
        "others": ("s_v", "ळ"),
        "L": ("s_cv21_0", ""),
        "^": ("s_cv21_0", ""),
    },
    "s_cv21_0": { 
        "i": ("s0", "ऌ"),
        "I": ("s0", "ॡ"),
        "others": ("s0", "ळ"),
    },
    "s_cv22": {
        "N": ("s_cv22_0", ""),
        "n": ("s_cv23_0", ""),
    },
    "s_cv22_0":{
        "a": ("s_v", "ङ"),
        "others": ("s_v", "ङ"),
    },
    "s_cv22_1":{
        "a": ("s_v", "ञ"),
        "others": ("s_v", "ञ"),
    },

    ##
    "s_cv23": {
        "a":("s0","आ"),
        "e":("s0","ऍ"),
        "E":("s0","ऍ"),
        "i":("s0","ऐ"),
        "u":("s0","औ"),
        "U": ("s0","ॲ"),
        "others":("s0","अ"),
    },
    "s_cv24": {
        "U": ("s_cv24_0",""),
        "others": ("s0","आ"),
    },
    "s_cv24_0": {
        "M": ("s0","ॐ"),
        "others": ("s0","ऑ"),
    },
    "s_cv25": {
        "i": ("s0", "ई"),
        "others": ("s0", "इ"),
    },
    "s_cv26": {
        "e": ("s0", "ई"),
        "others": ("s0", "ए"),
    },
    "s_cv27": {
        "u": ("s0", "ऊ"),
        "others": ("s0", "उ"),
    },
    "s_cv28": {
        "R": ("s_cv28_0", ""),
        "^": ("s_cv28_0", ""),
        "h": ("s_cv28_1", ""),
        "a": ("s_cv28_2", ""),
        "others": ("s_v", "र"),
    },
    "s_cv28_0": {
        "i": ("s0", "ऋ"),
        "I": ("s0", "ॠ"),
        "others": ("s0", "रर"),
    },
    "s_cv28_1": {
        "a": ("s_v", "ढ़"),
        "others": ("s_v", "ढ़"),
    },
    "s_cv28_2": {
        "a": ("s_v", "ड़"),
        "others": ("s_v", "ड़"),
    },
   
    "s_cv29": {
        "e": ("s0", "ऎ"),
        "o": ("s0", "ऒ"),
    },
    "s_cv30": {
        "M": ("s0", "ॐ"),
        "others": ("s0", "ओ"),
    },
    "s_cv31": {
        "m": ("s0","ं"),   # ं if multiple Diacritics are there
        "M": ("s0","ं"),   # ं if multiple Diacritics are there
        "N": ("s0","ँ"), # ँ
        "c": ("s0","ॅ"), #  ॅ
        "o": ("s0","ॉ"), #  ॉ
        "O": ("s0","ॉ"), #  ॉ
        "a": ("s0", "ऽ"),
        "others": ("s0", "।"),
        ## Consonants with Nuqta
        "D": ("s_cv32_0", ""),
    },
    "s_cv31_0": {
        "a": ("s0", "ड़"),
        "h": ("s_cv32_1", ""),
        "others": ("s0", "ड़"),
    },   
    "s_cv31_1": {
        "a": ("s0", "ढ़"),
        "others": ("s0", "ढ़"),
    },
    
    ##
    "s_cv32": {
        "a": ("s_v", "क़"),
        "others": ("s_v", "क़"),
    },
    "s_cv33": {
        "a": ("s_v", "ख़"),
        "others": ("s_v", "ख़"),
    },
    "s_cv34": {
        "a": ("s_v", "ग़"),
        "others": ("s_v", "ग़"),
        "Y": ("s_cv35_0", ""),
    },
    "s_cv34_0": {
        "a": ("s_v", "ज्ञ"),
        "others": ("s_v", "ग")
    },
    "s_cv35": {
        "a": ("s_v", "ज़"),
        "others": ("s_v", "ज़"),
    },
    "s_cv36": {
        "a": ("s_v", "फ़"),
        "others": ("s_v", "फ़"),
    },
    "s_cv37": {
        "a": ("s_v", "व़"),
        "others": ("s_v", "व़"),
    },
    "s_cv38": {
        "a": ("s_v", "क्ष"),
        "others": ("s_v", "क्ष"),
    },
  
    
    ## @Vowels

    "s_v": {
        "*": ("s_cVowel",""),
        "a": ("s_v1",""), # ा ,ै ,ौ
        "A": ("s0","ा"), # ा
        "i": ("s_v2",""), # ि, ी
        "I": ("s0","ि"), # ि
        "e": ("s_v3",""), # े ,ि 
        "E": ("s0","े"), # े
        "u": ("s_v4",""), # ु, ू
        "U": ("s0","ू"), #  ू
        "o": ("s0","ो"), # ो
        "O": ("s0","ो"), # ो
        "M": ("s0","ं"), # ं
        ".": ("s_v5",""), # ् ,ॅ,ॉ,़,।
        "R": ("s_v6",""), # ृ
        "L": ("s_v7",""), # ॢ
        "others": ("s0",""), 
    },
    "s_v1": {
        "a": ("s0", "ा"),
        "i": ("s0", "ै"),
        "u": ("s0", "ौ"),
    },
    "s_v2": {
        "i": ("s0","ि"),
        "others": ("s0", "ी"),
    },
    "s_v3": {
        "e": ("s0","ि"),
        "others": ("s0", "े"),
    },
    "s_v4": {
        "u": ("s0","ू"),
        "others": ("s0", "ु"),
    },
    "s_v5":{
        "m": ("s0","ं"), # ं
        "M": ("s0","ं"), # ं
        "n": ("s0","ं"), # ं
        "N": ("s0","ँ"), # ँ
        "h": ("s0","्"), # ्
        "c": ("s0","ॅ"), # ॅ 
        "o": ("s0","ॉ"), # ॉ
        "O": ("s0","ॉ"), # ॉ
    },
    "s_v6" :{
        "R": ("s_v6_0",""), # ृ
        "^": ("s_v6_0",""),
    },
    "s_v6_0" :{
        "i":("s0","ृ"),
        "others":("s_v","र"),
    },
    "s_v7" :{
        "L": ("s_v7_0",""),
        "^": ("s_v7_0",""),
    },
    "s_v7_0":{
        "i":("s0","ॢ"),
        "others": ("s_v","ल")
    }


}
