combine_letters = {
    "क्": {
        "क": "क्क", "ख": "क्ख", "ग": "क्ग", "घ": "क्घ", "ङ": "क्ङ", "च": "क्च", "छ": "क्छ", "ज": "क्ज", "झ": "क्झ", "ञ": "क्ञ",
        "ट": "क्ट", "ठ": "क्ठ", "ड": "क्ड", "ढ": "क्ढ", "ण": "क्ण", "त": "क्त", "थ": "क्थ", "द": "क्द", "ध": "क्ध", "न": "क्न",
        "प": "क्प", "फ": "क्फ", "ब": "क्ब", "भ": "क्भ", "म": "क्म", "य": "क्य", "र": "क्र", "ल": "क्ल", "व": "क्व", "श": "क्श",
        "ष": "क्ष", "स": "क्स", "ह": "क्ह", "ळ": "क्ळ", "क़": "क्क़", "ख़": "क्ख़", "ग़": "क्ग़", "ज़": "क्ज़", "फ़": "क्फ़",
        "ड़": "क्ड़", "ढ़": "क्ढ़", "व़": "क्व़", "क्ष": "क्क्ष", "त्र": "क्त्र", "ज्ञ": "क्ज्ञ", "श्र": "क्श्र"
    },
    "ख्": {
        "क": "ख्क", "ख": "ख्ख", "ग": "ख्ग", "घ": "ख्घ", "ङ": "ख्ङ", "च": "ख्च", "छ": "ख्छ", "ज": "ख्ज", "झ": "ख्झ", "ञ": "ख्ञ",
        "ट": "ख्ट", "ठ": "ख्ठ", "ड": "ख्ड", "ढ": "ख्ढ", "ण": "ख्ण", "त": "ख्त", "थ": "ख्थ", "द": "ख्द", "ध": "ख्ध", "न": "ख्न",
        "प": "ख्प", "फ": "ख्फ", "ब": "ख्ब", "भ": "ख्भ", "म": "ख्म", "य": "ख्य", "र": "ख्र", "ल": "ख्ल", "व": "ख्व", "श": "ख्श",
        "ष": "क्ष", "स": "ख्स", "ह": "ख्ह", "ळ": "ख्ळ", "क़": "ख्क़", "ख़": "ख्ख़", "ग़": "ख्ग़", "ज़": "ख्ज़", "फ़": "ख्फ़",
        "ड़": "ख्ड़", "ढ़": "ख्ढ़", "व़": "ख्व़", "क्ष": "ख्क्ष", "त्र": "ख्त्र", "ज्ञ": "ख्ज्ञ", "श्र": "ख्श्र"
    },
    "ग्": {
        "क": "ग्क", "ख": "ग्ख", "ग": "ग्ग", "घ": "ग्घ", "ङ": "ग्ङ", "च": "ग्च", "छ": "ग्छ", "ज": "ग्ज", "झ": "ग्झ", "ञ": "ग्ञ",
        "ट": "ग्ट", "ठ": "ग्ठ", "ड": "ग्ड", "ढ": "ग्ढ", "ण": "ग्ण", "त": "ग्त", "थ": "ग्थ", "द": "ग्द", "ध": "ग्ध", "न": "ग्न",
        "प": "ग्प", "फ": "ग्फ", "ब": "ग्ब", "भ": "ग्भ", "म": "ग्म", "य": "ग्य", "र": "ग्र", "ल": "ग्ल", "व": "ग्व", "श": "ग्श",
        "ष": "ग्ष", "स": "ग्स", "ह": "ग्ह", "ळ": "ग्ळ", "क़": "ग्क़", "ख़": "ग्ख़", "ग़": "ग्ग़", "ज़": "ग्ज़", "फ़": "ग्फ़",
        "ड़": "ग्ड़", "ढ़": "ग्ढ़", "व़": "ग्व़", "क्ष": "ग्क्ष", "त्र": "ग्त्र", "ज्ञ": "ग्ज्ञ", "श्र": "ग्श्र"
    },
    "घ्":{ 
        "क": "घ्क", "ख": "घ्ख", "ग": "घ्ग", "घ": "घ्घ", "ङ": "घ्ङ", "च": "घ्च", "छ": "घ्छ", "ज": "घ्ज", "झ": "घ्झ", "ञ": "घ्ञ",
        "ट": "घ्ट", "ठ": "घ्ठ", "ड": "घ्ड", "ढ": "घ्ढ", "ण": "घ्ण", "त": "घ्त", "थ": "घ्थ", "द": "घ्द", "ध": "घ्ध", "न": "घ्न",
        "प": "घ्प", "फ": "घ्फ", "ब": "घ्ब", "भ": "घ्भ", "म": "घ्म", "य": "घ्य", "र": "घ्र", "ल": "घ्ल", "व": "घ्व", "श": "घ्श",
        "ष": "घ्ष", "स": "घ्स", "ह": "घ्ह", "ळ": "घ्ळ", "क़": "घ्क़", "ख़": "घ्ख़", "ग़": "घ्ग़", "ज़": "घ्ज़", "फ़": "घ्फ़",
        "ड़": "घ्ड़", "ढ़": "घ्ढ़", "व़": "घ्व़", "क्ष": "घ्क्ष", "त्र": "घ्त्र", "ज्ञ": "घ्ज्ञ", "श्र": "घ्श्र"
    },
    "ङ्":{
        "क": "ङ्क", "ख": "ङ्ख", "ग": "ङ्ग", "घ": "ङ्घ", "ङ": "ङ्ङ", "च": "ङ्च", "छ": "ङ्छ", "ज": "ङ्ज", "झ": "ङ्झ", "ञ": "ङ्ञ",
        "ट": "ङ्ट", "ठ": "ङ्ठ", "ड": "ङ्ड", "ढ": "ङ्ढ", "ण": "ङ्ण", "त": "ङ्त", "थ": "ङ्थ", "द": "ङ्द", "ध": "ङ्ध", "न": "ङ्न",
        "प": "ङ्प", "फ": "ङ्फ", "ब": "ङ्ब", "भ": "ङ्भ", "म": "ङ्म", "य": "ङ्य", "र": "ङ्र", "ल": "ङ्ल", "व": "ङ्व", "श": "ङ्श",
        "ष": "ङ्ष", "स": "ङ्स", "ह": "ङ्ह", "ळ": "ङ्ळ", "क़": "ङ्क़", "ख़": "ङ्ख़", "ग़": "ङ्ग़", "ज़": "ङ्ज़", "फ़": "ङ्फ़",
        "ड़": "ङ्ड़", "ढ़": "ङ्ढ़", "व़": "ङ्व़", "क्ष": "ङ्क्ष", "त्र": "ङ्त्र", "ज्ञ": "ङ्ज्ञ", "श्र": "ङ्श्र"
    },
    "च्": {
        "क": "च्क", "ख": "च्ख", "ग": "च्ग", "घ": "च्घ", "ङ": "च्ङ", "च": "च्च", "छ": "च्छ", "ज": "च्ज", "झ": "च्झ", "ञ": "च्ञ",
        "ट": "च्ट", "ठ": "च्ठ", "ड": "च्ड", "ढ": "च्ढ", "ण": "च्ण", "त": "च्त", "थ": "च्थ", "द": "च्द", "ध": "च्ध", "न": "च्न",
        "प": "च्प", "फ": "च्फ", "ब": "च्ब", "भ": "च्भ", "म": "च्म", "य": "च्य", "र": "च्र", "ल": "च्ल", "व": "च्व", "श": "च्श",
        "ष": "च्ष", "स": "च्स", "ह": "च्ह", "ळ": "च्ळ", "क़": "च्क़", "ख़": "च्ख़", "ग़": "च्ग़", "ज़": "च्ज़", "फ़": "च्फ़",
        "ड़": "च्ड़", "ढ़": "च्ढ़", "व़": "च्व़", "क्ष": "च्क्ष", "त्र": "च्त्र", "ज्ञ": "च्ज्ञ", "श्र": "च्श्र"
    },
    "छ्": {
        "क": "छ्क", "ख": "छ्ख", "ग": "छ्ग", "घ": "छ्घ", "ङ": "छ्ङ", "च": "छ्च", "छ": "छ्छ", "ज": "छ्ज", "झ": "छ्झ", "ञ": "छ्ञ",
        "ट": "छ्ट", "ठ": "छ्ठ", "ड": "छ्ड", "ढ": "छ्ढ", "ण": "छ्ण", "त": "छ्त", "थ": "छ्थ", "द": "छ्द", "ध": "छ्ध", "न": "छ्न",
        "प": "छ्प", "फ": "छ्फ", "ब": "छ्ब", "भ": "छ्भ", "म": "छ्म", "य": "छ्य", "र": "छ्र", "ल": "छ्ल", "व": "छ्व", "श": "छ्श",
        "ष": "छ्ष", "स": "छ्स", "ह": "छ्ह", "ळ": "छ्ळ", "क़": "छ्क़", "ख़": "छ्ख़", "ग़": "छ्ग़", "ज़": "छ्ज़", "फ़": "छ्फ़",
        "ड़": "छ्ड़", "ढ़": "छ्ढ़", "व़": "छ्व़", "क्ष": "छ्क्ष", "त्र": "छ्त्र", "ज्ञ": "छ्ज्ञ", "श्र": "छ्श्र"
    },
    "ज्": {
        "क": "ज्क", "ख": "ज्ख", "ग": "ज्ग", "घ": "ज्घ", "ङ": "ज्ङ", "च": "ज्च", "छ": "ज्छ", "ज": "ज्ज", "झ": "ज्झ", "ञ": "ज्ञ",
        "ट": "ज्ट", "ठ": "ज्ठ", "ड": "ज्ड", "ढ": "ज्ढ", "ण": "ज्ण", "त": "ज्त", "थ": "ज्थ", "द": "ज्द", "ध": "ज्ध", "न": "ज्न",
        "प": "ज्प", "फ": "ज्फ", "ब": "ज्ब", "भ": "ज्भ", "म": "ज्म", "य": "ज्य", "र": "ज्र", "ल": "ज्ल", "व": "ज्व", "श": "ज्श",
        "ष": "ज्ष", "स": "ज्स", "ह": "ज्ह", "ळ": "ज्ळ", "क़": "ज्क़", "ख़": "ज्ख़", "ग़": "ज्ग़", "ज़": "ज्ज़", "फ़": "ज्फ़",
        "ड़": "ज्ड़", "ढ़": "ज्ढ़", "व़": "ज्व़", "क्ष": "ज्क्ष", "त्र": "ज्त्र", "ज्ञ": "ज्ज्ञ", "श्र": "ज्श्र"
    },
    "झ्": {
        "क": "झ्क", "ख": "झ्ख", "ग": "झ्ग", "घ": "झ्घ", "ङ": "झ्ङ", "च": "झ्च", "छ": "झ्छ", "ज": "झ्ज", "झ": "झ्झ", "ञ": "झ्ञ",
        "ट": "झ्ट", "ठ": "झ्ठ", "ड": "झ्ड", "ढ": "झ्ढ", "ण": "झ्ण", "त": "झ्त", "थ": "झ्थ", "द": "झ्द", "ध": "झ्ध", "न": "झ्न",
        "प": "झ्प", "फ": "झ्फ", "ब": "झ्ब", "भ": "झ्भ", "म": "झ्म", "य": "झ्य", "र": "झ्र", "ल": "झ्ल", "व": "झ्व", "श": "झ्श",
        "ष": "झ्ष", "स": "झ्स", "ह": "झ्ह", "ळ": "झ्ळ", "क़": "झ्क़", "ख़": "झ्ख़", "ग़": "झ्ग़", "ज़": "झ्ज़", "फ़": "झ्फ़",
        "ड़": "झ्ड़", "ढ़": "झ्ढ़", "व़": "झ्व़", "क्ष": "झ्क्ष", "त्र": "झ्त्र", "ज्ञ": "झ्ज्ञ", "श्र": "झ्श्र"
    },
    "ञ्": {
        "क": "ञ्क", "ख": "ञ्ख", "ग": "ञ्ग", "घ": "ञ्घ", "ङ": "ञ्ङ", "च": "ञ्च", "छ": "ञ्छ", "ज": "ञ्ज", "झ": "ञ्झ", "ञ": "ञ्ञ",
        "ट": "ञ्ट", "ठ": "ञ्ठ", "ड": "ञ्ड", "ढ": "ञ्ढ", "ण": "ञ्ण", "त": "ञ्त", "थ": "ञ्थ", "द": "ञ्द", "ध": "ञ्ध", "न": "ञ्न",
        "प": "ञ्प", "फ": "ञ्फ", "ब": "ञ्ब", "भ": "ञ्भ", "म": "ञ्म", "य": "ञ्य", "र": "ञ्र", "ल": "ञ्ल", "व": "ञ्व", "श": "ञ्श",
        "ष": "ञ्ष", "स": "ञ्स", "ह": "ञ्ह", "ळ": "ञ्ळ", "क़": "ञ्क़", "ख़": "ञ्ख़", "ग़": "ञ्ग़", "ज़": "ञ्ज़", "फ़": "ञ्फ़",
        "ड़": "ञ्ड़", "ढ़": "ञ्ढ़", "व़": "ञ्व़", "क्ष": "ञ्क्ष", "त्र": "ञ्त्र", "ज्ञ": "ञ्ज्ञ", "श्र": "ञ्श्र"
    },
    "ट्": {
        "क": "ट्क", "ख": "ट्ख", "ग": "ट्ग", "घ": "ट्घ", "ङ": "ट्ङ", "च": "ट्च", "छ": "ट्छ", "ज": "ट्ज", "झ": "ट्झ", "ञ": "ट्ञ",
        "ट": "ट्ट", "ठ": "ट्ठ", "ड": "ट्ड", "ढ": "ट्ढ", "ण": "ट्ण", "त": "ट्त", "थ": "ट्थ", "द": "ट्द", "ध": "ट्ध", "न": "ट्न",
        "प": "ट्प", "फ": "ट्फ", "ब": "ट्ब", "भ": "ट्भ", "म": "ट्म", "य": "ट्य", "र": "ट्र", "ल": "ट्ल", "व": "ट्व", "श": "ट्श",
        "ष": "ट्ष", "स": "ट्स", "ह": "ट्ह", "ळ": "ट्ळ", "क़": "ट्क़", "ख़": "ट्ख़", "ग़": "ट्ग़", "ज़": "ट्ज़", "फ़": "ट्फ़",
        "ड़": "ट्ड़", "ढ़": "ट्ढ़", "व़": "ट्व़", "क्ष": "ट्क्ष", "त्र": "ट्त्र", "ज्ञ": "ट्ज्ञ", "श्र": "ट्श्र"
    },
    "ठ्": {
        "क": "ठ्क", "ख": "ठ्ख", "ग": "ठ्ग", "घ": "ठ्घ", "ङ": "ठ्ङ", "च": "ठ्च", "छ": "ठ्छ", "ज": "ठ्ज", "झ": "ठ्झ", "ञ": "ठ्ञ",
        "ट": "ठ्ट", "ठ": "ठ्ठ", "ड": "ठ्ड", "ढ": "ठ्ढ", "ण": "ठ्ण", "त": "ठ्त", "थ": "ठ्थ", "द": "ठ्द", "ध": "ठ्ध", "न": "ठ्न",
        "प": "ठ्प", "फ": "ठ्फ", "ब": "ठ्ब",
        "भ": "ठ्भ", "म": "ठ्म", "य": "ठ्य", "र": "ठ्र", "ल": "ठ्ल", "व": "ठ्व", "श": "ठ्श", "ष": "ठ्ष", "स": "ठ्स", "ह": "ठ्ह",
        "ळ": "ठ्ळ", "क़": "ठ्क़", "ख़": "ठ्ख़", "ग़": "ठ्ग़", "ज़": "ठ्ज़", "फ़": "ठ्फ़", "ड़": "ठ्ड़", "ढ़": "ठ्ढ़",
        "व़": "ठ्व़", "क्ष": "ठ्क्ष", "त्र": "ठ्त्र", "ज्ञ": "ठ्ज्ञ", "श्र": "ठ्श्र",
    },
    
    "ड्": {
        "क": "ड्क", "ख": "ड्ख", "ग": "ड्ग", "घ": "ड्घ", "ङ": "ड्ङ", "च": "ड्च", "छ": "ड्छ", "ज": "ड्ज", "झ": "ड्झ", "ञ": "ड्ञ",
        "ट": "ड्ट", "ठ": "ड्ठ", "ड": "ड्ड", "ढ": "ड्ढ", "ण": "ड्ण", "त": "ड्त", "थ": "ड्थ", "द": "ड्द", "ध": "ड्ध", "न": "ड्न",
        "प": "ड्प", "फ": "ड्फ", "ब": "ड्ब", "भ": "ड्भ", "म": "ड्म", "य": "ड्य", "र": "ड्र", "ल": "ड्ल", "व": "ड्व", "श": "ड्श",
        "ष": "ड्ष", "स": "ड्स", "ह": "ड्ह", "ळ": "ड्ळ", "क़": "ड्क़", "ख़": "ड्ख़", "ग़": "ड्ग़", "ज़": "ड्ज़", "फ़": "ड्फ़",
        "ड़": "ड्ड़", "ढ़": "ड्ढ़", "व़": "ड्व़", "क्ष": "ड्क्ष", "त्र": "ड्त्र", "ज्ञ": "ड्ज्ञ", "श्र": "ड्श्र"
    },
    "ढ्": {
        "क": "ढ्क", "ख": "ढ्ख", "ग": "ढ्ग", "घ": "ढ्घ", "ङ": "ढ्ङ", "च": "ढ्च", "छ": "ढ्छ", "ज": "ढ्ज", "झ": "ढ्झ", "ञ": "ढ्ञ",
        "ट": "ढ्ट", "ठ": "ढ्ठ", "ड": "ढ्ड", "ढ": "ढ्ढ", "ण": "ढ्ण", "त": "ढ्त", "थ": "ढ्थ", "द": "ढ्द", "ध": "ढ्ध", "न": "ढ्न",
        "प": "ढ्प", "फ": "ढ्फ", "ब": "ढ्ब", "भ": "ढ्भ", "म": "ढ्म", "य": "ढ्य", "र": "ढ्र", "ल": "ढ्ल", "व": "ढ्व", "श": "ढ्श",
        "ष": "ढ्ष", "स": "ढ्स", "ह": "ढ्ह", "ळ": "ढ्ळ", "क़": "ढ्क़", "ख़": "ढ्ख़", "ग़": "ढ्ग़", "ज़": "ढ्ज़", "फ़": "ढ्फ़",
        "ड़": "ढ्ड़", "ढ़": "ढ्ढ़", "व़": "ढ्व़", "क्ष": "ढ्क्ष", "त्र": "ढ्त्र", "ज्ञ": "ढ्ज्ञ", "श्र": "ढ्श्र"
    },
    "ण्": {
        "क": "ण्क", "ख": "ण्ख", "ग": "ण्ग", "घ": "ण्घ", "ङ": "ण्ङ", "च": "ण्च", "छ": "ण्छ", "ज": "ण्ज", "झ": "ण्झ", "ञ": "ण्ञ",
        "ट": "ण्ट", "ठ": "ण्ठ", "ड": "ण्ड", "ढ": "ण्ढ", "ण": "ण्ण", "त": "ण्त", "थ": "ण्थ", "द": "ण्द", "ध": "ण्ध", "न": "ण्न",
        "प": "ण्प", "फ": "ण्फ", "ब": "ण्ब", "भ": "ण्भ", "म": "ण्म", "य": "ण्य", "र": "ण्र", "ल": "ण्ल", "व": "ण्व", "श": "ण्श",
        "ष": "ण्ष", "स": "ण्स", "ह": "ण्ह", "ळ": "ण्ळ", "क़": "ण्क़", "ख़": "ण्ख़", "ग़": "ण्ग़", "ज़": "ण्ज़", "फ़": "ण्फ़",
        "ड़": "ण्ड़", "ढ़": "ण्ढ़", "व़": "ण्व़", "क्ष": "ण्क्ष", "त्र": "ण्त्र", "ज्ञ": "ण्ज्ञ", "श्र": "ण्श्र"
    },
    "त्": {
        "क": "त्क", "ख": "त्ख", "ग": "त्ग", "घ": "त्घ", "ङ": "त्ङ", "च": "त्च", "छ": "त्छ", "ज": "त्ज", "झ": "त्झ", "ञ": "त्ञ",
        "ट": "त्ट", "ठ": "त्ठ", "ड": "त्ड", "ढ": "त्ढ", "ण": "त्ण", "त": "त्त", "थ": "त्थ", "द": "त्द", "ध": "त्ध", "न": "त्न",
        "प": "त्प", "फ": "त्फ", "ब": "त्ब", "भ": "त्भ", "म": "त्म", "य": "त्य", "र": "त्र", "ल": "त्ल", "व": "त्व", "श": "त्श",
        "ष": "त्ष", "स": "त्स", "ह": "त्ह", "ळ": "त्ळ", "क़": "त्क़", "ख़": "त्ख़", "ग़": "त्ग़", "ज़": "त्ज़", "फ़": "त्फ़",
        "ड़": "त्ड़", "ढ़": "त्ढ़", "व़": "त्व़", "क्ष": "त्क्ष", "त्र": "त्त्र", "ज्ञ": "त्ज्ञ", "श्र": "त्श्र"
    },
    "थ्": {
        "क": "थ्क", "ख": "थ्ख", "ग": "थ्ग", "घ": "थ्घ", "ङ": "थ्ङ", "च": "थ्च", "छ": "थ्छ", "ज": "थ्ज", "झ": "थ्झ", "ञ": "थ्ञ",
        "ट": "थ्ट", "ठ": "थ्ठ", "ड": "थ्ड", "ढ": "थ्ढ", "ण": "थ्ण", "त": "थ्त", "थ": "थ्थ", "द": "थ्द", "ध": "थ्ध", "न": "थ्न",
        "प": "थ्प", "फ": "थ्फ", "ब": "थ्ब", "भ": "थ्भ", "म": "थ्म", "य": "थ्य", "र": "थ्र", "ल": "थ्ल", "व": "थ्व", "श": "थ्श",
        "ष": "थ्ष", "स": "थ्स", "ह": "थ्ह", "ळ": "थ्ळ", "क़": "थ्क़", "ख़": "थ्ख़", "ग़": "थ्ग़", "ज़": "थ्ज़", "फ़": "थ्फ़",
        "ड़": "थ्ड़", "ढ़": "थ्ढ़", "व़": "थ्व़", "क्ष": "थ्क्ष", "त्र": "थ्त्र", "ज्ञ": "थ्ज्ञ", "श्र": "थ्श्र"
    },
    "द्": {
        "क": "द्क", "ख": "द्ख", "ग": "द्ग", "घ": "द्घ", "ङ": "द्ङ", "च": "द्च", "छ": "द्छ", "ज": "द्ज", "झ": "द्झ", "ञ": "द्ञ",
        "ट": "द्ट", "ठ": "द्ठ", "ड": "द्ड", "ढ": "द्ढ", "ण": "द्ण", "त": "द्त", "थ": "द्थ", "द": "द्द", "ध": "द्ध", "न": "द्न",
        "प": "द्प", "फ": "द्फ", "ब": "द्ब", "भ": "द्भ", "म": "द्म", "य": "द्य", "र": "द्र", "ल": "द्ल", "व": "द्व", "श": "द्श",
        "ष": "द्ष", "स": "द्स", "ह": "द्ह", "ळ": "द्ळ", "क़": "द्क़", "ख़": "द्ख़", "ग़": "द्ग़", "ज़": "द्ज़", "फ़": "द्फ़",
        "ड़": "द्ड़", "ढ़": "द्ढ़", "व़": "द्व़", "क्ष": "द्क्ष", "त्र": "द्त्र", "ज्ञ": "द्ज्ञ", "श्र": "द्श्र"
    },
    "ध्": {
        "क": "ध्क", "ख": "ध्ख", "ग": "ध्ग", "घ": "ध्घ", "ङ": "ध्ङ", "च": "ध्च", "छ": "ध्छ", "ज": "ध्ज", "झ": "ध्झ", "ञ": "ध्ञ",
        "ट": "ध्ट", "ठ": "ध्ठ", "ड": "ध्ड", "ढ": "ध्ढ", "ण": "ध्ण", "त": "ध्त", "थ": "ध्थ", "द": "ध्द", "ध": "ध्ध", "न": "ध्न",
        "प": "ध्प", "फ": "ध्फ", "ब": "ध्ब", "भ": "ध्भ", "म": "ध्म", "य": "ध्य", "र": "ध्र", "ल": "ध्ल", "व": "ध्व", "श": "ध्श",
        "ष": "ध्ष", "स": "ध्स", "ह": "ध्ह", "ळ": "ध्ळ", "क़": "ध्क़", "ख़": "ध्ख़", "ग़": "ध्ग़", "ज़": "ध्ज़", "फ़": "ध्फ़",
        "ड़": "ध्ड़", "ढ़": "ध्ढ़", "व़": "ध्व़", "क्ष": "ध्क्ष", "त्र": "ध्त्र", "ज्ञ": "ध्ज्ञ", "श्र": "ध्श्र"
    },
    "न्": {
        "क": "न्क", "ख": "न्ख", "ग": "न्ग", "घ": "न्घ", "ङ": "न्ङ", "च": "न्च", "छ": "न्छ", "ज": "न्ज", "झ": "न्झ", "ञ": "न्ञ",
        "ट": "न्ट", "ठ": "न्ठ", "ड": "न्ड", "ढ": "न्ढ", "ण": "न्ण", "त": "न्त", "थ": "न्थ", "द": "न्द", "ध": "न्ध", "न": "न्न",
        "प": "न्प", "फ": "न्फ", "ब": "न्ब", "भ": "न्भ", "म": "न्म", "य": "न्य", "र": "न्र", "ल": "न्ल", "व": "न्व", "श": "न्श",
        "ष": "न्ष", "स": "न्स", "ह": "न्ह", "ळ": "न्ळ", "क़": "न्क़", "ख़": "न्ख़", "ग़": "न्ग़", "ज़": "न्ज़", "फ़": "न्फ़",
        "ड़": "न्ड़", "ढ़": "न्ढ़", "व़": "न्व़", "क्ष": "न्क्ष", "त्र": "न्त्र", "ज्ञ": "न्ज्ञ", "श्र": "न्श्र"
    },
    "प्": {
        "क": "प्क", "ख": "प्ख", "ग": "प्ग", "घ": "प्घ", "ङ": "प्ङ", "च": "प्च", "छ": "प्छ", "ज": "प्ज", "झ": "प्झ", "ञ": "प्ञ",
        "ट": "प्ट", "ठ": "प्ठ", "ड": "प्ड", "ढ": "प्ढ", "ण": "प्ण", "त": "प्त", "थ": "प्थ", "द": "प्द", "ध": "प्ध", "न": "प्न",
        "प": "प्प", "फ": "प्फ", "ब": "प्ब", "भ": "प्भ", "म": "प्म", "य": "प्य", "र": "प्र", "ल": "प्ल", "व": "प्व", "श": "प्श",
        "ष": "प्ष", "स": "प्स", "ह": "प्ह", "ळ": "प्ळ", "क़": "प्क़", "ख़": "प्ख़", "ग़": "प्ग़", "ज़": "प्ज़", "फ़": "प्फ़",
        "ड़": "प्ड़", "ढ़": "प्ढ़", "व़": "प्व़", "क्ष": "प्क्ष", "त्र": "प्त्र", "ज्ञ": "प्ज्ञ", "श्र": "प्श्र"
    },
    "फ्": {
        "क": "फ्क", "ख": "फ्ख", "ग": "फ्ग", "घ": "फ्घ", "ङ": "फ्ङ", "च": "फ्च", "छ": "फ्छ", "ज": "फ्ज", "झ": "फ्झ", "ञ": "फ्ञ",
        "ट": "फ्ट", "ठ": "फ्ठ", "ड": "फ्ड", "ढ": "फ्ढ", "ण": "फ्ण", "त": "फ्त", "थ": "फ्थ", "द": "फ्द", "ध": "फ्ध", "न": "फ्न",
        "प": "फ्प", "फ": "फ्फ", "ब": "फ्ब", "भ": "फ्भ", "म": "फ्म", "य": "फ्य", "र": "फ्र", "ल": "फ्ल", "व": "फ्व", "श": "फ्श",
        "ष": "फ्ष", "स": "फ्स", "ह": "फ्ह", "ळ": "फ्ळ", "क़": "फ्क़", "ख़": "फ्ख़", "ग़": "फ्ग़", "ज़": "फ्ज़", "फ़": "फ्फ़",
        "ड़": "फ्ड़", "ढ़": "फ्ढ़", "व़": "फ्व़", "क्ष": "फ्क्ष", "त्र": "फ्त्र", "ज्ञ": "फ्ज्ञ", "श्र": "फ्श्र"
    },
    "ब्": {
        "क": "ब्क", "ख": "ब्ख", "ग": "ब्ग", "घ": "ब्घ", "ङ": "ब्ङ", "च": "ब्च", "छ": "ब्छ", "ज": "ब्ज", "झ": "ब्झ", "ञ": "ब्ञ",
        "ट": "ब्ट", "ठ": "ब्ठ", "ड": "ब्ड", "ढ": "ब्ढ", "ण": "ब्ण", "त": "ब्त", "थ": "ब्थ", "द": "ब्द", "ध": "ब्ध", "न": "ब्न",
        "प": "ब्प", "फ": "ब्फ", "ब": "ब्ब", "भ": "ब्भ", "म": "ब्म", "य": "ब्य", "र": "ब्र", "ल": "ब्ल", "व": "ब्व", "श": "ब्श",
        "ष": "ब्ष", "स": "ब्स", "ह": "ब्ह", "ळ": "ब्ळ", "क़": "ब्क़", "ख़": "ब्ख़", "ग़": "ब्ग़", "ज़": "ब्ज़", "फ़": "ब्फ़",
        "ड़": "ब्ड़", "ढ़": "ब्ढ़", "व़": "ब्व़", "क्ष": "ब्क्ष", "त्र": "ब्त्र", "ज्ञ": "ब्ज्ञ", "श्र": "ब्श्र"
    },
    "भ्": {
        "क": "भ्क", "ख": "भ्ख", "ग": "भ्ग", "घ": "भ्घ", "ङ": "भ्ङ", "च": "भ्च", "छ": "भ्छ", "ज": "भ्ज", "झ": "भ्झ", "ञ": "भ्ञ",
        "ट": "भ्ट", "ठ": "भ्ठ", "ड": "भ्ड", "ढ": "भ्ढ", "ण": "भ्ण", "त": "भ्त", "थ": "भ्थ", "द": "भ्द", "ध": "भ्ध", "न": "भ्न",
        "प": "भ्प", "फ": "भ्फ", "ब": "भ्ब", "भ": "भ्भ", "म": "भ्म", "य": "भ्य", "र": "भ्र", "ल": "भ्ल", "व": "भ्व", "श": "भ्श",
        "ष": "भ्ष", "स": "भ्स", "ह": "भ्ह", "ळ": "भ्ळ", "क़": "भ्क़", "ख़": "भ्ख़", "ग़": "भ्ग़", "ज़": "भ्ज़", "फ़": "भ्फ़",
        "ड़": "भ्ड़", "ढ़": "भ्ढ़", "व़": "भ्व़", "क्ष": "भ्क्ष", "त्र": "भ्त्र", "ज्ञ": "भ्ज्ञ", "श्र": "भ्श्र"
    },
    "म्": {
        "क": "म्क", "ख": "म्ख", "ग": "म्ग", "घ": "म्घ", "ङ": "म्ङ", "च": "म्च", "छ": "म्छ", "ज": "म्ज", "झ": "म्झ", "ञ": "म्ञ",
        "ट": "म्ट", "ठ": "म्ठ", "ड": "म्ड", "ढ": "म्ढ", "ण": "म्ण", "त": "म्त", "थ": "म्थ", "द": "म्द", "ध": "म्ध", "न": "म्न",
        "प": "म्प", "फ": "म्फ", "ब": "म्ब", "भ": "म्भ", "म": "म्म", "य": "म्य", "र": "म्र", "ल": "म्ल", "व": "म्व", "श": "म्श",
        "ष": "म्ष", "स": "म्स", "ह": "म्ह", "ळ": "म्ळ", "क़": "म्क़", "ख़": "म्ख़", "ग़": "म्ग़", "ज़": "म्ज़", "फ़": "म्फ़",
        "ड़": "म्ड़", "ढ़": "म्ढ़", "व़": "म्व़", "क्ष": "म्क्ष", "त्र": "म्त्र", "ज्ञ": "म्ज्ञ", "श्र": "म्श्र"
    },
    "य्": {
        "क": "य्क", "ख": "य्ख", "ग": "य्ग", "घ": "य्घ", "ङ": "य्ङ", "च": "य्च", "छ": "य्छ", "ज": "य्ज", "झ": "य्झ", "ञ": "य्ञ",
        "ट": "य्ट", "ठ": "य्ठ", "ड": "य्ड", "ढ": "य्ढ", "ण": "य्ण", "त": "य्त", "थ": "य्थ", "द": "य्द", "ध": "य्ध", "न": "य्न",
        "प": "य्प", "फ": "य्फ", "ब": "य्ब", "भ": "य्भ", "म": "य्म", "य": "य्य", "र": "यर", "ल": "य्ल", "व": "य्व", "श": "य्श",
        "ष": "य्ष", "स": "यस", "ह": "यह", "ळ": "य्ळ", "क़": "य्क़", "ख़": "य्ख़", "ग़": "य्ग़", "ज़": "य्ज़", "फ़": "य्फ़",
        "ड़": "य्ड़", "ढ़": "य्ढ़", "व़": "य्व़", "क्ष": "य्क्ष", "त्र": "य्त्र", "ज्ञ": "य्ज्ञ", "श्र": "य्श्र"
    },
    "र्": {
        "क": "र्क", "ख": "र्ख", "ग": "र्ग", "घ": "र्घ", "ङ": "र्ङ", "च": "र्च", "छ": "र्छ", "ज": "र्ज", "झ": "र्झ", "ञ": "र्ञ",
        "ट": "र्ट", "ठ": "र्ठ", "ड": "र्ड", "ढ": "र्ढ", "ण": "र्ण", "त": "र्त", "थ": "र्थ", "द": "र्द", "ध": "र्ध", "न": "र्न",
        "प": "र्प", "फ": "र्फ", "ब": "र्ब", "भ": "र्भ", "म": "र्म", "य": "र्य", "र": "र्र", "ल": "र्ल", "व": "र्व", "श": "र्श",
        "ष": "र्ष", "स": "र्स", "ह": "र्ह", "ळ": "र्ळ", "क़": "र्क़", "ख़": "र्ख़", "ग़": "र्ग़", "ज़": "र्ज़", "फ़": "र्फ़",
        "ड़": "र्ड़", "ढ़": "र्ढ़", "व़": "र्व़", "क्ष": "र्क्ष", "त्र": "र्त्र", "ज्ञ": "र्ज्ञ", "श्र": "र्श्र"
    },
    "ल्": {
        "क": "ल्क", "ख": "ल्ख", "ग": "ल्ग", "घ": "ल्घ", "ङ": "ल्ङ", "च": "ल्च", "छ": "ल्छ", "ज": "ल्ज", "झ": "ल्झ", "ञ": "ल्ञ",
        "ट": "ल्ट", "ठ": "ल्ठ", "ड": "ल्ड", "ढ": "ल्ढ", "ण": "ल्ण", "त": "ल्त", "थ": "ल्थ", "द": "ल्द", "ध": "ल्ध", "न": "ल्न",
        "प": "ल्प", "फ": "ल्फ", "ब": "लब", "भ": "ल्भ", "म": "ल्म", "य": "ल्य", "र": "ल्र", "ल": "ल्ल", "व": "ल्व", "श": "ल्श",
        "ष": "ल्ष", "स": "ल्स", "ह": "ल्ह", "ळ": "ल्ळ", "क़": "ल्क़", "ख़": "ल्ख़", "ग़": "ल्ग़", "ज़": "ल्ज़", "फ़": "ल्फ़",
        "ड़": "ल्ड़", "ढ़": "ल्ढ़", "व़": "ल्व़", "क्ष": "ल्क्ष", "त्र": "ल्त्र", "ज्ञ": "ल्ज्ञ", "श्र": "ल्श्र"
    },
    "व्": {
        "क": "व्क", "ख": "व्ख", "ग": "व्ग", "घ": "व्घ", "ङ": "व्ङ", "च": "व्च", "छ": "व्छ", "ज": "व्ज", "झ": "व्झ", "ञ": "व्ञ",
        "ट": "व्ट", "ठ": "व्ठ", "ड": "व्ड", "ढ": "व्ढ", "ण": "व्ण", "त": "व्त", "थ": "व्थ", "द": "व्द", "ध": "व्ध", "न": "व्न",
        "प": "व्प", "फ": "व्फ", "ब": "व्ब", "भ": "व्भ", "म": "व्म", "य": "व्य", "र": "व्र", "ल": "व्ल", "व": "व्व", "श": "व्श",
        "ष": "व्ष", "स": "व्स", "ह": "व्ह", "ळ": "व्ळ", "क़": "व्क़", "ख़": "व्ख़", "ग़": "व्ग़", "ज़": "व्ज़", "फ़": "व्फ़",
        "ड़": "व्ड़", "ढ़": "व्ढ़", "व़": "व्व़", "क्ष": "व्क्ष", "त्र": "व्त्र", "ज्ञ": "व्ज्ञ", "श्र": "व्श्र"
    },
    "श्": {
        "क": "श्क", "ख": "श्ख", "ग": "श्ग", "घ": "श्घ", "ङ": "श्ङ", "च": "श्च", "छ": "श्छ", "ज": "श्ज", "झ": "श्झ", "ञ": "श्ञ",
        "ट": "श्ट", "ठ": "श्ठ", "ड": "श्ड", "ढ": "श्ढ", "ण": "श्ण", "त": "श्त", "थ": "श्थ", "द": "श्द", "ध": "श्ध", "न": "श्न",
        "प": "श्प", "फ": "श्फ", "ब": "श्ब", "भ": "श्भ", "म": "श्म", "य": "श्य", "र": "श्र", "ल": "श्ल", "व": "श्व", "श": "श्श",
        "ष": "श्ष", "स": "श्स", "ह": "श्ह", "ळ": "श्ळ", "क़": "श्क़", "ख़": "श्ख़", "ग़": "श्ग़", "ज़": "श्ज़", "फ़": "श्फ़",
        "ड़": "श्ड़", "ढ़": "श्ढ़", "व़": "श्व़", "क्ष": "श्क्ष", "त्र": "श्त्र", "ज्ञ": "श्ज्ञ", "श्र": "श्श्र"
    },
    "ष्": {
        "क": "ष्क", "ख": "ष्ख", "ग": "ष्ग", "घ": "ष्घ", "ङ": "ष्ङ", "च": "ष्च", "छ": "ष्छ", "ज": "ष्ज", "झ": "ष्झ", "ञ": "ष्ञ",
        "ट": "ष्ट", "ठ": "ष्ठ", "ड": "ष्ड", "ढ": "ष्ढ", "ण": "ष्ण", "त": "ष्त", "थ": "ष्थ", "द": "ष्द", "ध": "ष्ध", "न": "ष्न",
        "प": "ष्प", "फ": "ष्फ", "ब": "ष्ब", "भ": "ष्भ", "म": "ष्म", "य": "ष्य", "र": "ष्र", "ल": "ष्ल", "व": "ष्व", "श": "ष्श",
        "ष": "ष्ष", "स": "ष्स", "ह": "ष्ह", "ळ": "ष्ळ", "क़": "ष्क़", "ख़": "ष्ख़", "ग़": "ष्ग़", "ज़": "ष्ज़", "फ़": "ष्फ़",
        "ड़": "ष्ड़", "ढ़": "ष्ढ़", "व़": "ष्व़", "क्ष": "ष्क्ष", "त्र": "ष्त्र", "ज्ञ": "ष्ज्ञ", "श्र": "ष्श्र"
    },
    "स्": {
        "क": "स्क", "ख": "स्ख", "ग": "स्ग", "घ": "स्घ", "ङ": "स्ङ", "च": "स्च", "छ": "स्छ", "ज": "स्ज", "झ": "स्झ", "ञ": "स्ञ",
        "ट": "स्ट", "ठ": "स्ठ", "ड": "स्ड", "ढ": "स्ढ", "ण": "स्ण", "त": "स्त", "थ": "स्थ", "द": "स्द", "ध": "स्ध", "न": "स्न",
        "प": "स्प", "फ": "स्फ", "ब": "स्ब", "भ": "स्भ", "म": "स्म", "य": "स्य", "र": "स्र", "ल": "स्ल", "व": "स्व", "श": "स्श",
        "ष": "स्ष", "स": "स्स", "ह": "स्ह", "ळ": "स्ळ", "क़": "स्क़", "ख़": "स्ख़", "ग़": "स्ग़", "ज़": "स्ज़", "फ़": "स्फ़",
        "ड़": "स्ड़", "ढ़": "स्ढ़", "व़": "स्व़", "क्ष": "स्क्ष", "त्र": "स्त्र", "ज्ञ": "स्ज्ञ", "श्र": "स्श्र"
    },
    "ह्": {
        "क": "ह्क", "ख": "ह्ख", "ग": "ह्ग", "घ": "ह्घ", "ङ": "ह्ङ", "च": "ह्च", "छ": "ह्छ", "ज": "ह्ज", "झ": "ह्झ", "ञ": "ह्ञ",
        "ट": "ह्ट", "ठ": "ह्ठ", "ड": "ह्ड", "ढ": "ह्ढ", "ण": "ह्ण", "त": "ह्त", "थ": "ह्थ", "द": "ह्द", "ध": "ह्ध", "न": "ह्न",
        "प": "ह्प", "फ": "ह्फ", "ब": "ह्ब", "भ": "ह्भ", "म": "ह्म", "य": "ह्य", "र": "ह्र", "ल": "ह्ल", "व": "ह्व", "श": "ह्श",
        "ष": "ह्ष", "स": "ह्स", "ह": "ह्ह", "ळ": "ह्ळ", "क़": "ह्क़", "ख़": "ह्ख़", "ग़": "ह्ग़", "ज़": "ह्ज़", "फ़": "ह्फ़",
        "ड़": "ह्ड़", "ढ़": "ह्ढ़", "व़": "ह्व़", "क्ष": "ह्क्ष", "त्र": "ह्त्र", "ज्ञ": "ह्ज्ञ", "श्र": "ह्श्र"
    },
    "ळ्": {
        "क": "ळ्क", "ख": "ळ्ख", "ग": "ळ्ग", "घ": "ळ्घ", "ङ": "ळ्ङ", "च": "ळ्च", "छ": "ळ्छ", "ज": "ळ्ज", "झ": "ळ्झ", "ञ": "ळ्ञ",
        "ट": "ळ्ट", "ठ": "ळ्ठ", "ड": "ळ्ड", "ढ": "ळ्ढ", "ण": "ळ्ण", "त": "ळ्त", "थ": "ळ्थ", "द": "ळ्द", "ध": "ळ्ध", "न": "ळ्न",
        "प": "ळ्प", "फ": "ळ्फ", "ब": "ळ्ब", "भ": "ळ्भ", "म": "ळ्म", "य": "ळ्य", "र": "ळ्र", "ल": "ळ्ल", "व": "ळ्व", "श": "ळ्श",
        "ष": "ळ्ष", "स": "ळ्स", "ह": "ळ्ह", "ळ": "ळ्ळ", "क़": "ळ्क़", "ख़": "ळ्ख़", "ग़": "ळ्ग़", "ज़": "ळ्ज़", "फ़": "ळ्फ़",
        "ड़": "ळ्ड़", "ढ़": "ळ्ढ़", "व़": "ळ्व़", "क्ष": "ळ्क्ष", "त्र": "ळ्त्र", "ज्ञ": "ळ्ज्ञ", "श्र": "ळ्श्र"
    },
    "क़्": {
        "क": "क़्क", "ख": "क़्ख", "ग": "क़्ग", "घ": "क़्घ", "ङ": "क़्ङ", "च": "क़्च", "छ": "क़्छ", "ज": "क़्ज", "झ": "क़्झ", "ञ": "क़्ञ",
        "ट": "क़्ट", "ठ": "क़्ठ", "ड": "क़्ड", "ढ": "क़्ढ", "ण": "क़्ण", "त": "क़्त", "थ": "क़्थ", "द": "क़्द", "ध": "क़्ध", "न": "क़्न",
        "प": "क़्प", "फ": "क़्फ", "ब": "क़्ब", "भ": "क़्भ", "म": "क़्म", "य": "क़्य", "र": "क़्र", "ल": "क़्ल", "व": "क़्व", "श": "क़्श",
        "ष": "क़्ष", "स": "क़्स", "ह": "क़्ह", "ळ": "क़्ळ", "क़": "क़्क़", "ख़": "क़्ख़", "ग़": "क़्ग़", "ज़": "क़्ज़", "फ़": "क़्फ़",
        "ड़": "क़्ड़", "ढ़": "क़्ढ़", "व़": "क़्व़", "क्ष": "क़्क्ष", "त्र": "क़्त्र", "ज्ञ": "क़्ज्ञ", "श्र": "क़्श्र"
    },
    "ख़्": {
        "क": "ख़्क", "ख": "ख़्ख", "ग": "ख़्ग", "घ": "ख़्घ", "ङ": "ख़्ङ", "च": "ख़्च", "छ": "ख़्छ", "ज": "ख़्ज", "झ": "ख़्झ", "ञ": "ख़्ञ",
        "ट": "ख़्ट", "ठ": "ख़्ठ", "ड": "ख़्ड", "ढ": "ख़्ढ", "ण": "ख़्ण", "त": "ख़्त", "थ": "ख़्थ", "द": "ख़्द", "ध": "ख़्ध", "न": "ख़्न",
        "प": "ख़्प", "फ": "ख़्फ", "ब": "ख़्ब", "भ": "ख़्भ", "म": "ख़्म", "य": "ख़्य", "र": "ख़्र", "ल": "ख़्ल", "व": "ख़्व", "श": "ख़्श",
        "ष": "ख़्ष", "स": "ख़्स", "ह": "ख़्ह", "ळ": "ख़्ळ", "क़": "ख़्क़", "ख़": "ख़्ख़", "ग़": "ख़्ग़", "ज़": "ख़्ज़", "फ़": "ख़्फ़",
        "ड़": "ख़्ड़", "ढ़": "ख़्ढ़", "व़": "ख़्व़", "क्ष": "ख़्क्ष", "त्र": "ख़्त्र", "ज्ञ": "ख़्ज्ञ", "श्र": "ख़्श्र"
    },
    "ग़्": {
        "क": "ग़्क", "ख": "ग़्ख", "ग": "ग़्ग", "घ": "ग़्घ", "ङ": "ग़्ङ", "च": "ग़्च", "छ": "ग़्छ", "ज": "ग़्ज", "झ": "ग़्झ", "ञ": "ग़्ञ",
        "ट": "ग़्ट", "ठ": "ग़्ठ", "ड": "ग़्ड", "ढ": "ग़्ढ", "ण": "ग़्ण", "त": "ग़्त", "थ": "ग़्थ", "द": "ग़्द", "ध": "ग़्ध", "न": "ग़्न",
        "प": "ग़्प", "फ": "ग़्फ", "ब": "ग़्ब", "भ": "ग़्भ", "म": "ग़्म", "य": "ग़्य", "र": "ग़्र", "ल": "ग़्ल", "व": "ग़्व", "श": "ग़्श",
        "ष": "ग़्ष", "स": "ग़्स", "ह": "ग़्ह", "ळ": "ग़्ळ", "क़": "ग़्क़", "ख़": "ग़्ख़", "ग़": "ग़्ग़", "ज़": "ग़्ज़", "फ़": "ग़्फ़",
        "ड़": "ग़्ड़", "ढ़": "ग़्ढ़", "व़": "ग़्व़", "क्ष": "ग़्क्ष", "त्र": "ग़्त्र", "ज्ञ": "ग़्ज्ञ", "श्र": "ग़्श्र"
    },
    "ज़्": {
        "क": "ज़्क", "ख": "ज़्ख", "ग": "ज़्ग", "घ": "ज़्घ", "ङ": "ज़्ङ", "च": "ज़्च", "छ": "ज़्छ", "ज": "ज़्ज", "झ": "ज़्झ", "ञ": "ज़्ञ",
        "ट": "ज़्ट", "ठ": "ज़्ठ", "ड": "ज़्ड", "ढ": "ज़्ढ", "ण": "ज़्ण", "त": "ज़्त", "थ": "ज़्थ", "द": "ज़्द", "ध": "ज़्ध", "न": "ज़्न",
        "प": "ज़्प", "फ": "ज़्फ", "ब": "ज़्ब", "भ": "ज़्भ", "म": "ज़्म", "य": "ज़्य", "र": "ज़्र", "ल": "ज़्ल", "व": "ज़्व", "श": "ज़्श",
        "ष": "ज़्ष", "स": "ज़्स", "ह": "ज़्ह", "ळ": "ज़्ळ", "क़": "ज़्क़", "ख़": "ज़्ख़", "ग़": "ज़्ग़", "ज़": "ज़्ज़", "फ़": "ज़्फ़",
        "ड़": "ज़्ड़", "ढ़": "ज़्ढ़", "व़": "ज़्व़", "क्ष": "ज़्क्ष", "त्र": "ज़्त्र", "ज्ञ": "ज़्ज्ञ", "श्र": "ज़्श्र"
    },
    "फ़्": {
        "क": "फ़्क", "ख": "फ़्ख", "ग": "फ़्ग", "घ": "फ़्घ", "ङ": "फ़्ङ", "च": "फ़्च", "छ": "फ़्छ", "ज": "फ़्ज", "झ": "फ़्झ", "ञ": "फ़्ञ",
        "ट": "फ़्ट", "ठ": "फ़्ठ", "ड": "फ़्ड", "ढ": "फ़्ढ", "ण": "फ़्ण", "त": "फ़्त", "थ": "फ़्थ", "द": "फ़्द", "ध": "फ़्ध", "न": "फ़्न",
        "प": "फ़्प", "फ": "फ़्फ", "ब": "फ़्ब", "भ": "फ़्भ", "म": "फ़्म", "य": "फ़्य", "र": "फ़्र", "ल": "फ़्ल", "व": "फ़्व", "श": "फ़्श",
        "ष": "फ़्ष", "स": "फ़्स", "ह": "फ़्ह", "ळ": "फ़्ळ", "क़": "फ़्क़", "ख़": "फ़्ख़", "ग़": "फ़्ग़", "ज़": "फ़्ज़", "फ़": "फ़्फ़",
        "ड़": "फ़्ड़", "ढ़": "फ़्ढ़", "व़": "फ़्व़", "क्ष": "फ़्क्ष", "त्र": "फ़्त्र", "ज्ञ": "फ़्ज्ञ", "श्र": "फ़्श्र"
    },
    "ड़्": {
        "क": "ड़्क", "ख": "ड़्ख", "ग": "ड़्ग", "घ": "ड़्घ", "ङ": "ड़्ङ", "च": "ड़्च", "छ": "ड़्छ", "ज": "ड़्ज", "झ": "ड़्झ", "ञ": "ड़्ञ",
        "ट": "ड़्ट", "ठ": "ड़्ठ", "ड": "ड़्ड", "ढ": "ड़्ढ", "ण": "ड़्ण", "त": "ड़्त", "थ": "ड़्थ", "द": "ड़्द", "ध": "ड़्ध", "न": "ड़्न",
        "प": "ड़्प", "फ": "ड़्फ", "ब": "ड़्ब", "भ": "ड़्भ", "म": "ड़्म", "य": "ड़्य", "र": "ड़्र", "ल": "ड़्ल", "व": "ड़्व", "श": "ड़्श",
        "ष": "ड़्ष", "स": "ड़्स", "ह": "ड़्ह", "ळ": "ड़्ळ", "क़": "ड़्क़", "ख़": "ड़्ख़", "ग़": "ड़्ग़", "ज़": "ड़्ज़", "फ़": "ड़्फ़",
        "ड़": "ड़्ड़", "ढ़": "ड़्ढ़", "व़": "ड़्व़", "क्ष": "ड़्क्ष", "त्र": "ड़्त्र", "ज्ञ": "ड़्ज्ञ", "श्र": "ड़्श्र"
    },
    "ढ़्": {
        "क": "ढ़्क", "ख": "ढ़्ख", "ग": "ढ़्ग", "घ": "ढ़्घ", "ङ": "ढ़्ङ", "च": "ढ़्च", "छ": "ढ़्छ", "ज": "ढ़्ज", "झ": "ढ़्झ", "ञ": "ढ़्ञ",
        "ट": "ढ़्ट", "ठ": "ढ़्ठ", "ड": "ढ़्ड", "ढ": "ढ़्ढ", "ण": "ढ़्ण", "त": "ढ़्त", "थ": "ढ़्थ", "द": "ढ़्द", "ध": "ढ़्ध", "न": "ढ़्न",
        "प": "ढ़्प", "फ": "ढ़्फ", "ब": "ढ़्ब", "भ": "ढ़्भ", "म": "ढ़्म", "य": "ढ़्य", "र": "ढ़्र", "ल": "ढ़्ल", "व": "ढ़्व", "श": "ढ़्श",
        "ष": "ढ़्ष", "स": "ढ़्स", "ह": "ढ़्ह", "ळ": "ढ़्ळ", "क़": "ढ़्क़", "ख़": "ढ़्ख़", "ग़": "ढ़्ग़", "ज़": "ढ़्ज़", "फ़": "ढ़्फ़",
        "ड़": "ढ़्ड़", "ढ़": "ढ़्ढ़", "व़": "ढ़्व़", "क्ष": "ढ़्क्ष", "त्र": "ढ़्त्र", "ज्ञ": "ढ़्ज्ञ", "श्र": "ढ़्श्र"
    },
    "व़्": {
        "क": "व़्क", "ख": "व़्ख", "ग": "व़्ग", "घ": "व़्घ", "ङ": "व़्ङ", "च": "व़्च", "छ": "व़्छ", "ज": "व़्ज", "झ": "व़्झ", "ञ": "व़्ञ",
        "ट": "व़्ट", "ठ": "व़्ठ", "ड": "व़्ड", "ढ": "व़्ढ", "ण": "व़्ण", "त": "व़्त", "थ": "व़्थ", "द": "व़्द", "ध": "व़्ध", "न": "व़्न",
        "प": "व़्प", "फ": "व़्फ", "ब": "व़्ब", "भ": "व़्भ", "म": "व़्म", "य": "व़्य", "र": "व़्र", "ल": "व़्ल", "व": "व़्व", "श": "व़्श",
        "ष": "व़्ष", "स": "व़्स", "ह": "व़्ह", "ळ": "व़्ळ", "क़": "व़्क़", "ख़": "व़्ख़", "ग़": "व़्ग़", "ज़": "व़्ज़", "फ़": "व़्फ़",
        "ड़": "व़्ड़", "ढ़": "व़्ढ़", "व़": "व़्व़", "क्ष": "व़्क्ष", "त्र": "व़्त्र", "ज्ञ": "व़्ज्ञ", "श्र": "व़्श्र"
    },
    "क्ष्": {
        "क": "क्ष्क", "ख": "क्ष्ख", "ग": "क्ष्ग", "घ": "क्ष्घ", "ङ": "क्ष्ङ", "च": "क्ष्च", "छ": "क्ष्छ", "ज": "क्ष्ज", "झ": "क्ष्झ", "ञ": "क्ष्ञ",
        "ट": "क्ष्ट", "ठ": "क्ष्ठ", "ड": "क्ष्ड", "ढ": "क्ष्ढ", "ण": "क्ष्ण", "त": "क्ष्त", "थ": "क्ष्थ", "द": "क्ष्द", "ध": "क्ष्ध", "न": "क्ष्न",
        "प": "क्ष्प", "फ": "क्ष्फ", "ब": "क्ष्ब", "भ": "क्ष्भ", "म": "क्ष्म", "य": "क्ष्य", "र": "क्ष्र", "ल": "क्ष्ल", "व": "क्ष्व", "श": "क्ष्श",
        "ष": "क्ष्ष", "स": "क्ष्स", "ह": "क्ष्ह", "ळ": "क्ष्ळ", "क़": "क्ष्क़", "ख़": "क्ष्ख़", "ग़": "क्ष्ग़", "ज़": "क्ष्ज़", "फ़": "क्ष्फ़",
        "ड़": "क्ष्ड़", "ढ़": "क्ष्ढ़", "व़": "क्ष्व़", "क्ष": "क्ष्क्ष", "त्र": "क्ष्त्र", "ज्ञ": "क्ष्ज्ञ", "श्र": "क्ष्श्र"
    },
    "त्र्": {
        "क": "त्र्क", "ख": "त्र्ख", "ग": "त्र्ग", "घ": "त्र्घ", "ङ": "त्र्ङ", "च": "त्र्च", "छ": "त्र्छ", "ज": "त्र्ज", "झ": "त्र्झ", "ञ": "त्र्ञ",
        "ट": "त्र्ट", "ठ": "त्र्ठ", "ड": "त्र्ड", "ढ": "त्र्ढ", "ण": "त्र्ण", "त": "त्र्त", "थ": "त्र्थ", "द": "त्र्द", "ध": "त्र्ध", "न": "त्र्न",
        "प": "त्र्प", "फ": "त्र्फ", "ब": "त्र्ब", "भ": "त्र्भ", "म": "त्र्म", "य": "त्र्य", "र": "त्र्र", "ल": "त्र्ल", "व": "त्र्व", "श": "त्र्श",
        "ष": "त्र्ष", "स": "त्र्स", "ह": "त्र्ह", "ळ": "त्र्ळ", "क़": "त्र्क़", "ख़": "त्र्ख़", "ग़": "त्र्ग़", "ज़": "त्र्ज़", "फ़": "त्र्फ़",
        "ड़": "त्र्ड़", "ढ़": "त्र्ढ़", "व़": "त्र्व़", "क्ष": "त्र्क्ष", "त्र": "त्र्त्र", "ज्ञ": "त्र्ज्ञ", "श्र": "त्र्श्र"
    },
    "ज्ञ्": {
        "क": "ज्ञ्क", "ख": "ज्ञ्ख", "ग": "ज्ञ्ग", "घ": "ज्ञ्घ", "ङ": "ज्ञ्ङ", "च": "ज्ञ्च", "छ": "ज्ञ्छ", "ज": "ज्ञ्ज", "झ": "ज्ञ्झ", "ञ": "ज्ञ्ञ",
        "ट": "ज्ञ्ट", "ठ": "ज्ञ्ठ", "ड": "ज्ञ्ड", "ढ": "ज्ञ्ढ", "ण": "ज्ञ्ण", "त": "ज्ञ्त", "थ": "ज्ञ्थ"
    }
}
